Julianiolo/ATmega32u4_Emulator/src/extras/Disassember.cpp
				BitArray<PassingBranchs::bitArrSize> occupied;
				size_t toInd = passingBranchesVec.size()-1;
				for (size_t c = fromInd; c < passingBranchesVec.size(); c++) { // go through line chunks
					PassingBranchs& pb = passingBranchesVec[c];

					if (pb.startLine > to) {
						toInd = c+1;
						break;
					}

					occupied |= pb.occupied;
				}
				
				size_t minFreePlace = occupied.getLBC();
				MCU_ASSERT(minFreePlace != (size_t)-1); // check that not every bit is set already
				branchRoot.displayDepth = minFreePlace;

				destMap[branchRoot.dest] = branchRoot.displayDepth;
			}

		skip:
			for(size_t j = fromInd; j<passingBranchesVec.size(); j++) {
				PassingBranchs& subPb = passingBranchesVec[j];
				if (subPb.startLine > to) {
					break;
				}
				subPb.occupied.setBitTo(branchRoot.displayDepth, true);
			}
		}

		size_t test[512];
		std::memset(test, 0, sizeof(test));
		for(size_t i = 0; i<branchRoots.size(); i++) {
			MCU_ASSERT(branchRoots[i].displayDepth < 512);
			test[branchRoots[i].displayDepth] = branchRoots[i].dest;
		}

		auto end = std::chrono::high_resolution_clock::now();
		{
			double ms = std::chrono::duration_cast<std::chrono::microseconds>(end - start).count()/1000.0;
			MCU_LOG_M(ATmega32u4::LogLevel_DebugOutput, StringUtils::format("branch calc took: %f ms", ms), "Disassembler");
		}
	}
	#endif

	for(size_t i = 0; i<branchRoots.size(); i++) {
		MCU_ASSERT(branchRoots[i].displayDepth != (size_t)-1);
		if (branchRoots[i].displayDepth > maxBranchDisplayDepth && branchRoots[i].displayDepth != (size_t)-3)
			maxBranchDisplayDepth = branchRoots[i].displayDepth;
	}

	MCU_LOGF_(ATmega32u4::LogLevel_DebugOutput, "branch max Display Depth is %" MCU_PRIuSIZE, maxBranchDisplayDepth);
}
#if 0
const BitArray<256>& A32u4::Disassembler::DisasmFile::processBranchesRecurse(size_t ind, size_t depth) {
	PassingBranchs& pb = passingBranchesVec[ind];
	for(size_t i = 0; i<pb.passing.size(); i++) {
		BranchRoot& branch = branchRoots[pb.passing[i]];
		if(branch.displayDepth == (size_t)-1) {
			branch.displayDepth = -2;
			const size_t from = std::min(branch.startLine, branch.destLine);
			const size_t to = std::max(branch.startLine, branch.destLine);
			size_t fromInd = passingBranchesInds[from];

			BitArray<256> occupied;
			size_t toInd = passingBranchesVec.size()-1;
			for(size_t j = fromInd; j<passingBranchesVec.size(); j++) {
				PassingBranchs& subPb = passingBranchesVec[j];
				if (subPb.startLine > to) {
					toInd = j+1;
					break;
				}

				occupied |= processBranchesRecurse(j, depth+1);
			}

			size_t minFreePlace = occupied.getLBC();
			MCU_ASSERT(minFreePlace != (size_t)-1); // check that not every bit is set already
			branch.displayDepth = minFreePlace;

			for(size_t j = fromInd; j<toInd; j++) {
				PassingBranchs& subPb = passingBranchesVec[j];
				subPb.occupied.setBitTo(minFreePlace, true);
			}
		}
	}
	return pb.occupied;
}
#else
size_t A32u4::Disassembler::DisasmFile::processBranchesRecurse(size_t ind, size_t depth) {
	auto& branchRoot = branchRoots[ind];
	//if(branchRoot.displayDepth == (size_t)-2) // currently being calculated [we dont need to check that bc the if bolow already does]
	//	return -2;
	if(branchRoot.displayDepth != (size_t)-1) // already calculated or currently beeing calculated
		return branchRoot.displayDepth;

	{
		bool used[256];
		branchRoot.displayDepth = -2;

		std::memset(used, 0, sizeof(used));

		const size_t from = std::min(branchRoot.startLine, branchRoot.destLine);
		const size_t to = std::max(branchRoot.startLine, branchRoot.destLine);

#if 1
		if (to - from > maxBranchShowDist) {
			branchRoot.displayDepth = -3;
			return -3;
		}
#endif

		size_t fromInd = passingBranchesInds[from];

		for (size_t c = fromInd; c < passingBranchesVec.size(); c++) { // go through line chunks
			PassingBranchs& pb = passingBranchesVec[c];

			if (pb.startLine > to)
				break;

			for(size_t i = 0; i< pb.passing.size(); i++) {
				auto& nextBranchRoot = branchRoots[pb.passing[i]];
				if (nextBranchRoot.destLine == branchRoot.destLine || nextBranchRoot.displayDepth == (size_t)-2) {
					continue;
				}

				size_t d;
				if(nextBranchRoot.displayDepth == (size_t)-1){
					d = processBranchesRecurse(pb.passing[i], depth+1);
				}else{
					d = nextBranchRoot.displayDepth;
				}

				if(d == (size_t)-2) // currently being calculated, so we skip it
					continue;
				if (d == (size_t)-3) // ignored branch
					continue;

				MCU_ASSERT(d < sizeof(used));

				used[d] = true;
			}
		}

		size_t min = -1;
		for(size_t i = 0; i<sizeof(used); i++) {
			if(!used[i]) {
				min = i;
				break;
			}
		}

		branchRoot.displayDepth = min;

		return branchRoot.displayDepth;
	}
}
#endif

void A32u4::Disassembler::DisasmFile::processContent() {
	size_t lineInd = 1;
	lines.clear();
	lines.push_back(0);
	addrs.clear();
	isLineProgram.clear();

	const char* str = content.c_str();
	size_t i = 0;
	for(; i < content.size(); i++) {
		if(str[i] == '\n'){
			lines.push_back(i+1);

			addAddrToList(str + lines[lineInd - 1], str + i, lineInd);

			lineInd++;
		}
	}
	addAddrToList(str + lines[lineInd - 1], str + content.size(), lineInd);
	//lineInd++;

	lines.resize(lineInd);
	addrs.resize(lineInd);

	processBranches();

	for (size_t i = 0; i < lines.size(); i++) {
		addrmcu_t addr = addrs[i];
		if (addr != Addrs_notAnAddr && addr != Addrs_symbolLabel) {

		}
	}
}

size_t A32u4::Disassembler::DisasmFile::getLineIndFromAddr(addrmcu_t Addr) const{
	if(isEmpty())
		return -1;

	size_t from = 0;
	size_t to = lines.size()-1;
	while (to > 0 && (addrs[to] == Addrs_notAnAddr || addrs[to] == Addrs_symbolLabel))
		to--;
	if (addrs[to] < Addr || to == (decltype(to))-1)
		return -1;

	while(from != to){
		size_t mid = from + ((to-from)/2);
		const size_t mid_orig = mid;

		uint16_t lineAddr;
		//while((lineAddr = addrs[mid]) == Addrs_notAnAddr || lineAddr == Addrs_symbolLabel)
		//	mid++;

		size_t cnt = 1;
		do {
			mid = mid_orig + ((cnt % 2) ? -(ptrdiff_t)cnt / 2 : cnt / 2);
			lineAddr = addrs[mid];
			cnt++;
		} while (cnt / 2 < to - from && (lineAddr == Addrs_notAnAddr || lineAddr == Addrs_symbolLabel));

