Julianiolo/ATmega32u4_Emulator/src/extras/Disassember.cpp
		if(lineAddr == Addr){
			return mid;
		}
		else {
			if (lineAddr < Addr) {
				if (mid == from) {
					if (addrs[to] == Addr) {
						return to;
					}
					else {
						return -1;
					}
				}
					
				from = mid;
			}else{
				if (mid == to) {
					if (mid_orig == to)
						return from;
					else
						to = mid_orig;
				}
				else {
					to = mid;
				}
			}
		}
	}
	return from;
}
bool A32u4::Disassembler::DisasmFile::isEmpty() const {
	return content.size() == 0;
}
size_t A32u4::Disassembler::DisasmFile::getNumLines() const {
	return lines.size();
}
bool A32u4::Disassembler::DisasmFile::isSelfDisassembled() const {
	return disasmData.get() != nullptr;
}

A32u4::Disassembler::DisasmFile::DisasmData::DisasmData(size_t size) : disasmed(size){

}
void A32u4::Disassembler::DisasmFile::DisasmData::addFuncCallAddr(pc_t addr){
	if(funcCalls.find(addr) == funcCalls.end()){
		funcCalls.insert(addr);
	}
}
size_t A32u4::Disassembler::DisasmFile::DisasmData::sizeBytes() const {
	size_t sum = 0;

	sum += DataUtils::approxSizeOf(disasmed);

	sum += DataUtils::approxSizeOf(lines, [](const Line& v) {return sizeof(v.addr) + DataUtils::approxSizeOf(v.str) + sizeof(v.inst_ind); });

	sum += DataUtils::approxSizeOf(funcCalls);

	return sum;
}

addrmcu_t A32u4::Disassembler::DisasmFile::getPrevActualAddr(size_t line) const {
	if (addrs.size() == 0)
		return 0;

	if (line >= addrs.size())
		line = addrs.size() - 1;

	while (true) {
		if (addrIsActualAddr(addrs[line]))
			return addrs[line];

		if (line == 0)
			break;
		line--;
	}
	return 0;
}
addrmcu_t A32u4::Disassembler::DisasmFile::getNextActualAddr(size_t line) const {
	const size_t line_orig = line;
	while (line < lines.size()) {
		if (addrIsActualAddr(addrs[line]))
			return addrs[line];

		line++;
	}
	// we didnt find anything, so now we search before the given line
	return getPrevActualAddr(line_orig);
}

size_t A32u4::Disassembler::DisasmFile::PassingBranchs::sizeBytes() const {
	size_t sum = 0;

	sum += DataUtils::approxSizeOf(passing);
	sum += sizeof(startLine);
	sum += DataUtils::approxSizeOf(occupied);

	return sum;
}


size_t A32u4::Disassembler::DisasmFile::sizeBytes() const {
	size_t sum = 0;

	sum += DataUtils::approxSizeOf(content);
	sum += DataUtils::approxSizeOf(lines);
	sum += DataUtils::approxSizeOf(addrs);
	sum += DataUtils::approxSizeOf(isLineProgram); // [linenumber] = true if line is part of the program, false if not (like data, empty...)
	sum += DataUtils::approxSizeOf(labels); // [symbAddress] = linenumber

	sum += DataUtils::approxSizeOf(branchRoots, [](const BranchRoot& v) {return sizeof(BranchRoot); });
	sum += DataUtils::approxSizeOf(branchRootInds); // [linenumber] = ind to branch root object of this line (-1 if line is not a branchroot)

		sum += DataUtils::approxSizeOf(passingBranchesVec[0]);

	sum += DataUtils::approxSizeOf(passingBranchesVec);
	sum += DataUtils::approxSizeOf(passingBranchesInds);  // [linenumber] = ind to pass to passingBranchesVec to get: branchRootInd of all branches passing this address/line
	sum += sizeof(maxBranchDisplayDepth);

	if (disasmData)
		sum += disasmData->sizeBytes();

	return sum;
}

std::string A32u4::Disassembler::getParamStr(uint16_t val, uint8_t type) {
	switch (type)
	{
	case INST_PAR_TYPE_RAWVAL:
		return "0x" + StringUtils::uIntToHexStr(val, 2);
	case INST_PAR_TYPE_ADDR:
		return "0x" + StringUtils::uIntToHexStr(val, 4);

	case INST_PAR_TYPE_RAWVALDEC:
		return std::to_string(val);

	case INST_PAR_TYPE_REG:
		return "R" + std::to_string(val);

	case INST_PAR_TYPE_OFFSET: //never used
		return "." + getSignInt(((int8_t)val)*(int16_t)2);
	case INST_PAR_TYPE_OFFSET16: //never used
		return "." + getSignInt((int16_t)val*(int32_t)2);

	case INST_PAR_TYPE_REG_OFFSET:
		return std::to_string(val);

	default:
		return "ERROR: " + std::to_string(type);
	}
}

std::string A32u4::Disassembler::disassemble(uint16_t word, uint16_t word2, uint16_t PC) {
	std::string disasm = disassembleRaw(word, word2);
	std::string instBytes = StringUtils::format("%02x %02x ", word&0xFF, (word & 0xFF00) >> 8);
	if (InstHandler::is2WordInst(word))
		instBytes += StringUtils::format("%02x %02x ", word2 & 0xFF, (word2 & 0xFF00) >> 8);
	else
		instBytes += "      ";
	return StringUtils::format("    %4x:\t%s\t%s", PC*2, instBytes.c_str(), disasm.c_str());
}
std::string A32u4::Disassembler::disassembleRaw(uint16_t word, uint16_t word2) {
	uint8_t Inst_ind = InstHandler::getInstInd3(word);
	if (Inst_ind >= IND_COUNT_)
		return StringUtils::format(".word 0x%04x", word);
	InstHandler::Inst_ELEM inst = InstHandler::instList[Inst_ind];

	std::string out = inst.name;
	out += "\t";

	switch (Inst_ind) {
		case IND_EOR:
			if (inst.par1(word) == inst.par2(word)) {
				out = "CLR R" + std::to_string(inst.par1(word));
				goto end_params;
			}
			else {
				goto sw1_def;
			}

		case IND_JMP:
		case IND_CALL:
			out += std::string("0x") + StringUtils::uIntToHexStr(word2 * 2, 4);
			break;

		case IND_RJMP:
		case IND_RCALL:
			out += std::string(".") + std::to_string(InstHandler::getk12_c_sin(word) * 2);
			break;

		case IND_LPM_0:
			out += " R0, Z"; break;

		default:
		sw1_def:
		{
			if (inst.par1 == NULL) {
				goto end_params;
			}
			out += getParamStr(inst.par1(word), inst.parTypes & 0xF);
		}
	}

	switch (Inst_ind) {
		case IND_LDS:
		case IND_STS:
			out += ", 0x" + StringUtils::uIntToHexStr(word2, 4);
			break;

		case IND_LD_X:
		case IND_ST_X:
			out += ", X"; break;
		case IND_LD_XpostInc:
		case IND_ST_XpostInc:
			out += ", X+"; break;
		case IND_LD_XpreDec:
		case IND_ST_XpreDec:
			out += ", -X"; break;

		case IND_LD_Y:
		case IND_ST_Y:
			out += ", Y"; break;
		case IND_LD_YpostInc:
		case IND_ST_YpostInc:
			out += ", Y+"; break;
		case IND_LD_YpreDec:
		case IND_ST_YpreDec:
			out += ", -Y"; break;

		case IND_LDD_Y:
		case IND_STD_Y:
			out += ", Y" + getParamStr(inst.par2(word), INST_PAR_TYPE_REG_OFFSET);
			break;

		case IND_LD_Z:
		case IND_ST_Z:
			out += ", Z"; break;
		case IND_LD_ZpostInc:
		case IND_ST_ZpostInc:
			out += ", Z+"; break;
		case IND_LD_ZpreDec:
		case IND_ST_ZpreDec:
			out += ", -Z"; break;

		case IND_LPM_d:
			out += ", Z"; break;
		case IND_LPM_dpostInc:
			out += ", Z+"; break;

