Julianiolo/ATmega32u4_Emulator/src/extras/Disassember.cpp
		case IND_LDD_Z:
		case IND_STD_Z:
			out += ", Z" + getParamStr(inst.par2(word), INST_PAR_TYPE_REG_OFFSET);
			break;


		default:
		{
			if (inst.par2 == NULL) {
				goto end_params;
			}
			out += ", ";

			out += getParamStr(inst.par2(word), (inst.parTypes & 0xF0) >> 4);
		}
	}
end_params:

	return out;
}

std::string A32u4::Disassembler::getSignInt(int32_t val) {
	if (val >= 0) {
		return "+" +std::to_string(val);
	}
	else {
		return std::to_string(val);
	}
}
pc_t A32u4::Disassembler::getJumpDests(uint16_t word, uint16_t word2, pc_t pc) {
	uint8_t Inst_ind = InstHandler::getInstInd3(word);
	switch (Inst_ind) {
		case IND_JMP:
		{
			uint32_t k = InstHandler::getLongAddr(word,word2);
			return k;
		}
		case IND_RJMP:
		{
			int16_t k = InstHandler::getk12_c_sin(word);
			return pc + k + 1;
		}

		case IND_SBRC:
		case IND_SBRS:
		case IND_SBIC:
		case IND_SBIS:
		{
			return pc + 2;
		}

		case IND_BRBC:
		case IND_BRBS:
		{
			int8_t k = (int8_t)InstHandler::getk7_c_sin(word);
			return pc + k + 1;
		}


		case IND_CALL:
		{
			uint32_t k = InstHandler::getLongAddr(word, word2);
			return k;
		}
		case IND_RCALL:
		{
			int16_t k = InstHandler::getk12_c_sin(word);
			return pc + k + 1;
		}
	}
	return -1;
}

void A32u4::Disassembler::disasmRecurse(pc_t start, const Flash* data, DisasmFile::DisasmData* disasmData){
	MCU_ASSERT(start < data->sizeWords());
	pc_t PC = start;
	while(true){
		if (PC >= data->sizeWords() || disasmData->disasmed.get(PC)) {
			//printf("finished at %x from %x\n", PC*2, start*2);
			return;
		}

		uint16_t word = data->getInst(PC);
		uint16_t word2 = 0;
		uint8_t Inst_ind = InstHandler::getInstInd3(word);
		bool is2word = InstHandler::is2WordInst(word);
		if(is2word)
			word2 = data->getInst(PC+1);

		std::string disasm = disassemble(word, word2, PC);
		//std::cout << disasm << std::endl;
		disasmData->lines.push_back({ PC, disasm, Inst_ind });
		disasmData->disasmed.set(PC,true);

		switch(Inst_ind){
			case IND_JMP:
			{
				uint32_t k = InstHandler::getLongAddr(word,word2);
				PC = k;
				continue;
			}
			case IND_RJMP:
			{
				int16_t k = InstHandler::getk12_c_sin(word);
				PC += k+1;
				continue;
			}

			case IND_SBRC:
			case IND_SBRS:
			case IND_SBIC:
			case IND_SBIS:
			{
				disasmRecurse(PC+2, data, disasmData);
				break;
			}


			case IND_BRBC:
			case IND_BRBS:
			{
				int8_t k = (int8_t)InstHandler::getk7_c_sin(word);
				disasmRecurse(PC+k+1, data, disasmData);
				break;
			}


			case IND_CALL:
			{
				uint32_t k = InstHandler::getLongAddr(word, word2);
				disasmRecurse(k, data, disasmData);
				disasmData->addFuncCallAddr(k);
				break;
			}
			case IND_RCALL:
			{
				int16_t k = InstHandler::getk12_c_sin(word);
				if (k != 0) {
					disasmRecurse(PC+k+1, data, disasmData);
					disasmData->addFuncCallAddr(PC+k+1);
				}
				
				break;
			}

			case IND_RET:
			case IND_RETI:
				return;
		}

		PC++;
		if(is2word)
			PC++;
	}
}

/*

std::string out = disassembleRaw(word, word2);
std::string add = "" + stringExtras::intToHex(PC * 2, 4) + ":   ";
add += stringExtras::intToHex(word & 0xFF, 2) + " " + stringExtras::intToHex((word & 0xFF00) >> 8, 2);
if (!InstHandler::is2WordInst(word)) {
add += "       ";
}
else {
add += " " + stringExtras::intToHex(word2 & 0xFF, 2) + " " + stringExtras::intToHex((word2 & 0xFF00) >> 8, 2) + " ";
}
out = add + out;
*/